% Номер в группе 8

% ЗАДАНИЕ №3
% ШУРИН
%(Человек, Его шурин)
brotherinlaw(X, Y):-
  %для поиска применяется обход по всем мужчинам
  %это очень простой и очевидный способ,
  %который гарантирует нахождение всех шуринов
  %Х имеет жену -> он мужчина
  male(X),
  child(Z,X),
  child(Z,M),
  %нашли жену
  female(M),
  %ищем ее родителей
  child(M,A),
  child(M,B),
  female(A),
  male(B),
  %ищем брата
  child(Y,A),
  child(Y,B),
  male(Y).


  %ЗАДАНИЕ №4
  %ОПРЕДЕЛЕНИЕ РОДСТВА ДВУХ КОНКРЕТНЫХ ИНДИВИДУУМОВ
  % Кто Y для X?
  %(Родство, X, Y)


relative(X,Y,Z):-relative(X,Y,Z,'deep').
%очевидные отношения
relative(father, X, Y, _):- child(X,Y), male(Y).
relative(mother, X, Y, _):- child(X,Y), female(Y).
relative(daugther, X, Y, _):-child(Y,X), female(Y).
relative(son, X, Y, _):-    child(Y,X), male(Y).
relative(sister, X, Y, _):- female(Y),
  child(X, A), child(X, B), child(Y, A), child(Y, B),
  female(A), male(B),not(X = Y).
relative(brother, X, Y, _):- male(Y),
  child(X, A), child(X, B),  child(Y, A), child(Y, B),
  female(A), male(B) ,not(X = Y).
relative(wife, X, Y,_):-    female(Y), male(X),
  child(C, X), child(C, Y).
relative(husband, X, Y,_):- male(Y), female(X),
  child(C, X), child(C, Y).
relative(brotherinlaw, X, Y,_):-brotherinlaw(X, Y).
%более глубокая взаимосвязь
relative(Surf-Deep, X, Y, N):-                N = 'deep',
  relative(Deep, X, Intermediate, 'deep'),    not(X = Intermediate),
  relative(Surf, Intermediate, Y, 'surface'), not(Y = Intermediate), not(X = Y).



  child("Анатолий Мирный", "Дмитрий Мирный").
  child("Анатолий Мирный", "Маргарита Успенский").
  child("Анна Сидорова", "Александра Романова").
  child("Анна Сидорова", "Иван Мединцев").
  child("Антонина Абрамова", "Василий Абрамов").
  child("Антонина Абрамова", "Зоя Курчатова").
  child("Валентина Абрамова", "Василий Абрамов").
  child("Валентина Абрамова", "Зоя Курчатова").
  child("Виктор Лукашкин", "Анастасия Шишкина").
  child("Виктор Лукашкин", "Сергей Лукашкин").
  child("Вячеслав Лукашкин", "Валентина Абрамова").
  child("Вячеслав Лукашкин", "Виктор Лукашкин").
  child("Елизавета Лукашкина", "Вячеслав Лукашкин").
  child("Елизавета Лукашкина", "Татьяна Мединцева").
  child("Константин Лукашкин", "Вячеслав Лукашкин").
  child("Константин Лукашкин", "Татьяна Мединцева").
  child("Маргарита Успенский", "Нина Абрамова").
  child("Маргарита Успенский", "Яков Успенский").
  child("Наталья Спиридонова", "Евгений Кольчугин").
  child("Наталья Спиридонова", "Светлана Лукашкина").
  child("Нина Абрамова", "Василий Абрамов").
  child("Нина Абрамова", "Зоя Курчатова").
  child("Светлана Лукашкина", "Валентина Абрамова").
  child("Светлана Лукашкина", "Виктор Лукашкин").
  child("Соня Сидорова", "Анна Сидорова").
  child("Соня Сидорова", "Сергей Сидоров").
  child("Татьяна Мединцева", "Александра Романова").
  child("Татьяна Мединцева", "Иван Мединцев").
  female("Александра Романова").
  female("Анастасия Шишкина").
  female("Анна Сидорова").
  female("Антонина Абрамова").
  female("Валентина Абрамова").
  female("Елизавета Лукашкина").
  female("Зоя Курчатова").
  female("Маргарита Успенский").
  female("Наталья Спиридонова").
  female("Нина Абрамова").
  female("Светлана Лукашкина").
  female("Соня Сидорова").
  female("Татьяна Мединцева").
  male("Анатолий Мирный").
  male("Василий Абрамов").
  male("Виктор Лукашкин").
  male("Вячеслав Лукашкин").
  male("Дмитрий Мирный").
  male("Евгений Кольчугин").
  male("Иван Мединцев").
  male("Константин Лукашкин").
  male("Максим Спиридонов").
  male("Сергей Лукашкин").
  male("Сергей Сидоров").
  male("Яков Успенский").
